In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
index = pd.date_range('1/1/2000', periods=8)

In [4]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=list('ABC'))

In [5]:
df

                   A         B         C
2000-01-01  0.119663 -1.056403 -0.241601
2000-01-02 -2.233547  0.891281 -0.025079
2000-01-03  1.213262 -0.142750  2.081160
2000-01-04 -1.229399  0.056119 -2.558543
2000-01-05 -1.125902 -1.293472  0.435878
2000-01-06  1.329652  1.608919 -1.119135
2000-01-07 -0.693252  0.381051  0.883464
2000-01-08  1.197697  0.693240  0.670097

In [6]:
df[:5].T

   2000-01-01  2000-01-02  2000-01-03  2000-01-04  2000-01-05
A    0.119663   -2.233547    1.213262   -1.229399   -1.125902
B   -1.056403    0.891281   -0.142750    0.056119   -1.293472
C   -0.241601   -0.025079    2.081160   -2.558543    0.435878

In [7]:
np.exp(df)

                   A         B         C
2000-01-01  1.127117  0.347704  0.785369
2000-01-02  0.107148  2.438250  0.975233
2000-01-03  3.364443  0.866971  8.013759
2000-01-04  0.292468  1.057724  0.077417
2000-01-05  0.324360  0.274317  1.546320
2000-01-06  3.779728  4.997405  0.326562
2000-01-07  0.499948  1.463822  2.419266
2000-01-08  3.312478  2.000185  1.954427

In [8]:
np.sqrt(df)

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in sqrt
  """Entry point for launching an IPython kernel.

                   A         B         C
2000-01-01  0.345923       NaN       NaN
2000-01-02       NaN  0.944077       NaN
2000-01-03  1.101482       NaN  1.442623
2000-01-04       NaN  0.236895       NaN
2000-01-05       NaN       NaN  0.660210
2000-01-06  1.153105  1.268432       NaN
2000-01-07       NaN  0.617293  0.939928
2000-01-08  1.094393  0.832610  0.818595

In [9]:
np.asarray(df)

array([[ 0.11966285, -1.05640291, -0.2416013 ],
       [-2.23354655,  0.89128066, -0.02507917],
       [ 1.21326248, -0.14274995,  2.08115991],
       [-1.22939871,  0.05611942, -2.55854326],
       [-1.12590186, -1.29347196,  0.43587763],
       [ 1.32965202,  1.60891876, -1.11913505],
       [-0.69325159,  0.38105094,  0.88346404],
       [ 1.1976966 ,  0.6932397 ,  0.67009727]])

In [10]:
ser = pd.Series([1, 2, 3, 4])

In [11]:
np.exp(ser)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [12]:
ser1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

In [13]:
ser2 = pd.Series([1, 3, 5], index=['b', 'a', 'c'])

In [14]:
ser1

a    1
b    2
c    3
dtype: int64

In [15]:
ser2

b    1
a    3
c    5
dtype: int64

In [16]:
np.remainder(ser1, ser2)

a    0
b    2
c    3
dtype: int64

In [17]:
ser3 = pd.Series([2, 4, 6], index=['b', 'c', 'd'])

In [18]:
ser3

b    2
c    4
d    6
dtype: int64

In [19]:
np.remainder(ser2, ser3)

b    1
a    3
c    5
dtype: int64

In [20]:
ser = pd.Series([1, 2, 3])

In [21]:
idx = pd.Index([4, 5, 6])

In [22]:
np.maximum(ser,idx)

0    4
1    5
2    6
dtype: int64

In [26]:
baseball = pd.read_csv('Baseball.csv')

In [27]:
baseball.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 322 entries, 0 to 321
Data columns (total 26 columns):
Unnamed: 0    322 non-null int64
name1         322 non-null object
name2         322 non-null object
atbat86       322 non-null int64
hits86        322 non-null int64
homer86       322 non-null int64
runs86        322 non-null int64
rbi86         322 non-null int64
walks86       322 non-null int64
years         322 non-null int64
atbat         322 non-null int64
hits          322 non-null int64
homeruns      322 non-null int64
runs          322 non-null int64
rbi           322 non-null int64
walks         322 non-null int64
league86      322 non-null object
div86         322 non-null object
team86        322 non-null object
posit86       322 non-null object
outs86        322 non-null int64
assist86      322 non-null int64
error86       322 non-null int64
sal87         263 non-null float64
league87      322 non-null object
team87        322 non-null object
dtypes: float64(1), int64(17), object(8)
memory usage: 65.5+ KB

In [28]:
print(baseball.iloc[-20:, :12].to_string())

     Unnamed: 0   name1       name2  atbat86  hits86  homer86  runs86  rbi86  walks86  years  atbat  hits
302         303    Tony       Armas       16       2        0       1      0        0      2     28     4
303         304    Tony   Bernazard      562     169       17      88     73       53      8   3181   841
304         305    Tony   Fernandez      687     213       10      91     65       27      4   1518   448
305         306    Tony       Gwynn      642     211       14     107     59       52      5   2364   770
306         307    Tony        Pena      510     147       10      56     52       53      7   2872   821
307         308    Tony       Perez      200      51        2      14     29       25     23   9778  2732
308         309    Tony    Phillips      441     113        5      76     52       76      5   1546   397
309         310   Vance         Law      360      81        5      37     44       37      7   2268   566
310         311   Vince     Coleman      600     139        0      94     29       60      2   1236   309
311         312     Von       Hayes      610     186       19     107     98       74      6   2728   753
312         313    Wade       Boggs      580     207        8     107     71      105      5   2778   978
313         314   Wally     Backman      387     124        1      67     27       36      7   1775   506
314         315   Wally      Joyner      593     172       22      82    100       57      1    593   172
315         316   Wayne  Krenchicki      221      53        2      21     23       22      8   1063   283
316         317   Wayne    Tolleson      475     126        3      61     43       52      6   1700   433
317         318    Will       Clark      408     117       11      66     41       34      1    408   117
318         319  Willie       McGee      497     127        7      65     48       37      5   2703   806
319         320  Willie    Randolph      492     136        5      76     50       94     12   5511  1511
320         321  Willie      Upshaw      573     144        9      85     60       78      8   3198   857
321         322  Willie      Wilson      631     170        9      77     44       31     11   4908  1457

In [29]:
pd.DataFrame(np.random.randn(3, 12))

,0,1,2,3,4,5,6,7,8,9,10,11
0,-1.879755,-0.570624,-2.150365,1.282483,1.479457,-0.971019,0.114003,-0.700388,-0.135987,-0.894534,0.028057,0.060577
1,-0.124038,-0.939512,0.622936,0.163935,-1.416503,-0.622488,-0.146669,-0.410033,0.144451,0.002198,0.178854,-0.854009
2,0.380673,-0.982221,-0.996887,-1.316511,0.105061,0.766851,0.916231,0.011884,1.291793,-0.477234,0.710284,-0.106075

In [30]:
pd.set_option('display.width', 40) # default is 80

In [31]:
pd.DataFrame(np.random.randn(3, 12))

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.867154,-0.511155,0.982191,-0.334306,2.558194,-1.113631,-1.667580,0.928159,1.788616,1.175826,0.959077,0.546840
1,1.899208,0.746931,0.845479,0.235318,0.002203,-0.651674,0.559889,1.387238,0.218350,0.353351,-0.732866,0.804635
2,0.015535,1.959701,2.291609,-1.246907,-2.896957,2.247714,0.051893,1.171012,0.852871,-0.230989,0.294797,1.003391

In [32]:
pd.set_option('display.width', 80) # default is 80

In [33]:
pd.DataFrame(np.random.randn(3, 12))

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.726392,-0.258905,-0.509697,0.264092,0.466980,0.019087,1.516077,0.414462,0.399358,0.901656,0.870984,-0.867808
1,0.416867,-0.195435,-1.160316,0.313017,0.465982,0.205890,-0.313713,0.617509,-0.024150,-0.005169,0.703188,-1.589021
2,0.969573,0.242571,-0.897670,0.409488,0.256067,-0.018112,0.119568,0.029066,0.621511,-0.463557,-0.196631,1.318143

In [34]:
df = pd.DataFrame({'foo1': np.random.randn(5),
                   'foo2': np.random.randn(5)})

In [35]:
df

       foo1      foo2
0 -1.101362 -0.989223
1 -0.342822  0.858173
2  0.284737 -1.150983
3 -0.748485  0.934779
4  1.465677 -1.987282

In [36]:
df.foo1

0   -1.101362
1   -0.342822
2    0.284737
3   -0.748485
4    1.465677
Name: foo1, dtype: float64

In [37]:
df.foo2

0   -0.989223
1    0.858173
2   -1.150983
3    0.934779
4   -1.987282
Name: foo2, dtype: float64

In [38]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                  columns=['one', 'two', 'three'])

In [39]:
df['four'] = 'bar'

In [40]:
df['five'] = df['one'] > 0

In [41]:
df

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
c -0.593480  0.969370 -0.691699  bar  False
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
h  0.302526  0.065967  1.112710  bar   True

In [42]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [43]:
df2

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.593480  0.969370 -0.691699  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.302526  0.065967  1.112710  bar   True

In [44]:
df2['one']

a    0.090001
b         NaN
c   -0.593480
d         NaN
e    0.116017
f    0.322416
g         NaN
h    0.302526
Name: one, dtype: float64

In [45]:
pd.isna(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [46]:
df2['four'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: four, dtype: bool

In [47]:
df2.isna()

     one    two  three   four   five
a  False  False  False  False  False
b   True   True   True   True   True
c  False  False  False  False  False
d   True   True   True   True   True
e  False  False  False  False  False
f  False  False  False  False  False
g   True   True   True   True   True
h  False  False  False  False  False

In [48]:
None == None

True

In [49]:
np.nan == np.nan

False

In [50]:
None == np.nan

False

In [51]:
df2['one'] == np.nan

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
Name: one, dtype: bool

In [52]:
df2['one'] == None

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
Name: one, dtype: bool

In [53]:
pd.Series([1, 2, np.nan, 4], dtype=pd.Int64Dtype())

0      1
1      2
2    NaN
3      4
dtype: Int64

In [54]:
df2 = df.copy()

In [55]:
df2['timestamp'] = pd.Timestamp('20120101')

In [56]:
df2

        one       two     three four   five  timestamp
a  0.090001 -1.444419 -0.619717  bar   True 2012-01-01
c -0.593480  0.969370 -0.691699  bar  False 2012-01-01
e  0.116017  0.103942  0.249755  bar   True 2012-01-01
f  0.322416 -0.064197  1.321684  bar   True 2012-01-01
h  0.302526  0.065967  1.112710  bar   True 2012-01-01

In [57]:
df2.loc[['a', 'c', 'h'], ['one', 'timestamp']] = np.nan

In [58]:
df2

        one       two     three four   five  timestamp
a       NaN -1.444419 -0.619717  bar   True        NaT
c       NaN  0.969370 -0.691699  bar  False        NaT
e  0.116017  0.103942  0.249755  bar   True 2012-01-01
f  0.322416 -0.064197  1.321684  bar   True 2012-01-01
h       NaN  0.065967  1.112710  bar   True        NaT

In [59]:
df2.dtypes.value_counts()

float64           3
object            1
bool              1
datetime64[ns]    1
dtype: int64

In [60]:
s = pd.Series([1, 2, 3])

In [61]:
s.iloc[0] = None

In [62]:
s

0    NaN
1    2.0
2    3.0
dtype: float64

In [63]:
s = pd.Series(["a", "b", "c"])

In [64]:
s.loc[0] = None

In [65]:
s.loc[1] = np.nan

In [66]:
s

0    None
1     NaN
2       c
dtype: object

In [67]:
s.loc[2] = ''

In [68]:
s

0    None
1     NaN
2
dtype: object

In [69]:
s.loc[2] = ' '

In [70]:
s

0    None
1     NaN
2
dtype: object

In [71]:
s.loc[2] = 'c'

In [72]:
s

0    None
1     NaN
2       c
dtype: object

In [75]:
a = df.copy()

In [76]:
a

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
c -0.593480  0.969370 -0.691699  bar  False
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
h  0.302526  0.065967  1.112710  bar   True

In [77]:
a.drop(['three', 'four', 'five'], axis=1)

        one       two
a  0.090001 -1.444419
c -0.593480  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [78]:
a = a.drop(['three', 'four', 'five'], axis=1)

In [79]:
a

        one       two
a  0.090001 -1.444419
c -0.593480  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [80]:
a.at['a','one'] = np.nan

In [81]:
a.at['c','one'] = np.nan

In [82]:
a

        one       two
a       NaN -1.444419
c       NaN  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [ ]:
a = a.drop(['b'], axis=0)

In [83]:
a

        one       two
a       NaN -1.444419
c       NaN  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [84]:
b = a.copy()

In [85]:
b

        one       two
a       NaN -1.444419
c       NaN  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [86]:
b.at['h','one'] = np.nan

In [87]:
b['three'] = np.random.randn(5)

In [88]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [89]:
a

        one       two
a       NaN -1.444419
c       NaN  0.969370
e  0.116017  0.103942
f  0.322416 -0.064197
h  0.302526  0.065967

In [90]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [91]:
a + b

        one  three       two
a       NaN    NaN -2.888838
c       NaN    NaN  1.938739
e  0.232034    NaN  0.207885
f  0.644832    NaN -0.128394
h       NaN    NaN  0.131935

In [92]:
df

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
c -0.593480  0.969370 -0.691699  bar  False
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
h  0.302526  0.065967  1.112710  bar   True

In [93]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [94]:
df['one'].sum()

0.23747966652699798

In [95]:
df.mean(axis = 1)

a   -0.243534
c   -0.078952
e    0.367429
f    0.644976
h    0.620301
dtype: float64

In [96]:
df.mean(axis = 0)

one      0.047496
two     -0.073867
three    0.274547
five     0.800000
dtype: float64

In [97]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [98]:
b.cumsum()

        one       two     three
a       NaN -1.444419  0.252900
c       NaN -0.475049  0.504367
e  0.116017 -0.371107 -0.442576
f  0.438433 -0.435304  0.476379
h       NaN -0.369337  0.140740

In [99]:
b.cumsum(skipna=False)

   one       two     three
a  NaN -1.444419  0.252900
c  NaN -0.475049  0.504367
e  NaN -0.371107 -0.442576
f  NaN -0.435304  0.476379
h  NaN -0.369337  0.140740

In [100]:
pd.Series([np.nan]).sum()

0.0

In [101]:
np.nan

nan

In [102]:
pd.Series([]).sum()

0.0

In [103]:
pd.Series([np.nan]).prod()

1.0

In [104]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [105]:
b.groupby('one').mean()

               two     three
one
0.116017  0.103942 -0.946944
0.322416 -0.064197  0.918955

In [106]:
df2

        one       two     three four   five  timestamp
a       NaN -1.444419 -0.619717  bar   True        NaT
c       NaN  0.969370 -0.691699  bar  False        NaT
e  0.116017  0.103942  0.249755  bar   True 2012-01-01
f  0.322416 -0.064197  1.321684  bar   True 2012-01-01
h       NaN  0.065967  1.112710  bar   True        NaT

In [107]:
df2.fillna(0)

        one       two     three four   five            timestamp
a  0.000000 -1.444419 -0.619717  bar   True                    0
c  0.000000  0.969370 -0.691699  bar  False                    0
e  0.116017  0.103942  0.249755  bar   True  2012-01-01 00:00:00
f  0.322416 -0.064197  1.321684  bar   True  2012-01-01 00:00:00
h  0.000000  0.065967  1.112710  bar   True                    0

In [108]:
df2['one'].fillna('missing')

a     missing
c     missing
e    0.116017
f    0.322416
h     missing
Name: one, dtype: object

In [109]:
df

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
c -0.593480  0.969370 -0.691699  bar  False
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
h  0.302526  0.065967  1.112710  bar   True

In [110]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [111]:
b.fillna(method='pad')

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h  0.322416  0.065967 -0.335639

In [112]:
b.at['a','one'] = 1.25

In [113]:
b

        one       two     three
a  1.250000 -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [114]:
b.at['a','one'] = np.nan

In [115]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [116]:
b

        one       two     three
a       NaN -1.444419  0.252900
c       NaN  0.969370  0.251467
e  0.116017  0.103942 -0.946944
f  0.322416 -0.064197  0.918955
h       NaN  0.065967 -0.335639

In [117]:
dff = pd.DataFrame(np.random.randn(10,3), columns=list('ABC'))

In [118]:
dff.iloc[3:5,0] = np.nan

In [119]:
dff.iloc[4:6,1] = np.nan

In [120]:
dff.iloc[5:8,2] = np.nan

In [121]:
dff

          A         B         C
0 -0.212172 -0.744280  0.949913
1  1.880923 -0.535202 -0.572995
2  0.065489  0.397866 -1.375075
3       NaN  0.235507  1.187802
4       NaN       NaN  0.371110
5  1.678539       NaN       NaN
6 -1.039055  0.390757       NaN
7 -1.161851 -0.223122       NaN
8  0.405435 -1.437796 -1.460977
9 -0.510042 -0.533065 -0.831455

In [122]:
dff.fillna(dff.mean())

          A         B         C
0 -0.212172 -0.744280  0.949913
1  1.880923 -0.535202 -0.572995
2  0.065489  0.397866 -1.375075
3  0.138408  0.235507  1.187802
4  0.138408 -0.306167  0.371110
5  1.678539 -0.306167 -0.247382
6 -1.039055  0.390757 -0.247382
7 -1.161851 -0.223122 -0.247382
8  0.405435 -1.437796 -1.460977
9 -0.510042 -0.533065 -0.831455

In [123]:
dff.fillna(dff.mean()['B':'C'])

          A         B         C
0 -0.212172 -0.744280  0.949913
1  1.880923 -0.535202 -0.572995
2  0.065489  0.397866 -1.375075
3       NaN  0.235507  1.187802
4       NaN -0.306167  0.371110
5  1.678539 -0.306167 -0.247382
6 -1.039055  0.390757 -0.247382
7 -1.161851 -0.223122 -0.247382
8  0.405435 -1.437796 -1.460977
9 -0.510042 -0.533065 -0.831455

In [124]:
dff.where(pd.notna(dff), dff.mean(), axis='columns')

          A         B         C
0 -0.212172 -0.744280  0.949913
1  1.880923 -0.535202 -0.572995
2  0.065489  0.397866 -1.375075
3  0.138408  0.235507  1.187802
4  0.138408 -0.306167  0.371110
5  1.678539 -0.306167 -0.247382
6 -1.039055  0.390757 -0.247382
7 -1.161851 -0.223122 -0.247382
8  0.405435 -1.437796 -1.460977
9 -0.510042 -0.533065 -0.831455

In [125]:
df

        one       two     three four   five
a  0.090001 -1.444419 -0.619717  bar   True
c -0.593480  0.969370 -0.691699  bar  False
e  0.116017  0.103942  0.249755  bar   True
f  0.322416 -0.064197  1.321684  bar   True
h  0.302526  0.065967  1.112710  bar   True

In [126]:
df3 = pd.DataFrame(np.random.randn(5,3), index=list('acefh'), columns=('one', 'two', 'three'))

In [127]:
df3

        one       two     three
a  0.934726 -1.137742 -0.431723
c  1.988260 -0.609132 -0.422505
e  0.664752  0.763927  1.737086
f  1.137014 -2.338938 -0.014288
h  0.719564 -1.098538  1.775898

In [128]:
df3['one'] = np.nan

In [129]:
df3

   one       two     three
a  NaN -1.137742 -0.431723
c  NaN -0.609132 -0.422505
e  NaN  0.763927  1.737086
f  NaN -2.338938 -0.014288
h  NaN -1.098538  1.775898

In [130]:
df3.dropna(axis=0)

Empty DataFrame
Columns: [one, two, three]
Index: []

In [131]:
df3.dropna(axis=1)

        two     three
a -1.137742 -0.431723
c -0.609132 -0.422505
e  0.763927  1.737086
f -2.338938 -0.014288
h -1.098538  1.775898

In [132]:
df3['one'].dropna()

Series([], Name: one, dtype: float64)

In [133]:
df3

   one       two     three
a  NaN -1.137742 -0.431723
c  NaN -0.609132 -0.422505
e  NaN  0.763927  1.737086
f  NaN -2.338938 -0.014288
h  NaN -1.098538  1.775898